#типы данных: числа(int) и ("строки")str
#числа
print(5*5)
print(5/2)
print(type('mama'))#покажет тип кода строка
print(type(5))#покажет тип integer (целое число)
print(type(2.0)) #тип class 'float' дробное числов
print(4.5/22)
print(type(0.20454545454545456))
print(32//5) # // целочисленное деление (сколько чисел поместится в число)
print(25/5) # и / просто деление
print(26%5)# посчитатет остаток знак %
print(29%5)#остаток
print(3**3)# этот знак - возведение в степень, т.е. 3*3*3
print(11**11)# этот знак - возведение в степень, т.е. 3*3*3
print(2.0)#дробное число
#далее строки
print('I can write')
print('I'+' can'+' write')# строки можно сложить с помощью +
# логический тип данных  False True
print(5>3)# true истина
print(5<3)# False ложь
print(5<3,43<33)# False False
print(5<3,43>33)# False True
print(5==3)# False знак равенства
print(5!=3)# True знак неравенства
print(5==5)# True знак равенства
print(2!=3 and 2==2) # знаки and (и) or (или)
print(2!=3 or 2!=2) # будет истина, тк при первом выражении 2 не равно 3
print(2!=3 and 2!=2)# False тк 2не равно 3 "И" 2 не рвно 2
#меняем типы
print(type(int('2233222'))) #это тип строка <class 'str'> изменен на int- число
print(5<7)
print(5>7)

# Строки и индексация строк

name = "Dima" # переменная name
print(name) # напиши имя
print('Hi '+ name+"!") # применена конкатенация, или же сложение
print(name*4) #дублируем переменную с помощью умножения
# Индексация подразумевает наличие порядкового номера у каждого элемента строки.
print (name[0:3]) #  индексация с певого симвала имени (0) до 3 не включая его, по факту до 2 символа
print(name[ :2])
print(name[1:3])
print(name[ : :2])# применен шаг подстраки благодаря второму ":"
print(name[ : :-1]) # будут выведены все символы, поскольку мы не указали границ, но уже в обратном порядке.


























